In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.random.randn(5,4),index= 'A B C D E'.split(), columns= 'W X Y Z'.split())

In [3]:
df

          W         X         Y         Z
A -0.745157 -0.730127 -0.431263  1.928113
B  1.438835 -0.461587 -1.706683 -2.621806
C -0.190142  0.834918 -1.957688 -0.166679
D -1.219565  0.690758  0.907605 -1.420249
E -0.424708 -0.387945  1.753420  0.864991

# Selection and Indexing

In [4]:
df['Y']

A   -0.431263
B   -1.706683
C   -1.957688
D    0.907605
E    1.753420
Name: Y, dtype: float64

In [5]:
df['X']

A   -0.730127
B   -0.461587
C    0.834918
D    0.690758
E   -0.387945
Name: X, dtype: float64

In [6]:
df.X   # Not recommended method

A   -0.730127
B   -0.461587
C    0.834918
D    0.690758
E   -0.387945
Name: X, dtype: float64

In [7]:
df[['X','Y']]

          X         Y
A -0.730127 -0.431263
B -0.461587 -1.706683
C  0.834918 -1.957688
D  0.690758  0.907605
E -0.387945  1.753420

In [8]:
type(df[['X','Y']])

pandas.core.frame.DataFrame

In [9]:
type(df['X'])

pandas.core.series.Series

***create a new colum***

In [10]:
df['New'] = df['X']+df['Y']

In [11]:
df

          W         X         Y         Z       New
A -0.745157 -0.730127 -0.431263  1.928113 -1.161390
B  1.438835 -0.461587 -1.706683 -2.621806 -2.168270
C -0.190142  0.834918 -1.957688 -0.166679 -1.122770
D -1.219565  0.690758  0.907605 -1.420249  1.598363
E -0.424708 -0.387945  1.753420  0.864991  1.365475

In [12]:
df.drop('New', axis=1) # This will only drop for this line of code

          W         X         Y         Z
A -0.745157 -0.730127 -0.431263  1.928113
B  1.438835 -0.461587 -1.706683 -2.621806
C -0.190142  0.834918 -1.957688 -0.166679
D -1.219565  0.690758  0.907605 -1.420249
E -0.424708 -0.387945  1.753420  0.864991

In [13]:
df

          W         X         Y         Z       New
A -0.745157 -0.730127 -0.431263  1.928113 -1.161390
B  1.438835 -0.461587 -1.706683 -2.621806 -2.168270
C -0.190142  0.834918 -1.957688 -0.166679 -1.122770
D -1.219565  0.690758  0.907605 -1.420249  1.598363
E -0.424708 -0.387945  1.753420  0.864991  1.365475

In [14]:
df.drop('New',axis=1,inplace = True)

In [15]:
df

          W         X         Y         Z
A -0.745157 -0.730127 -0.431263  1.928113
B  1.438835 -0.461587 -1.706683 -2.621806
C -0.190142  0.834918 -1.957688 -0.166679
D -1.219565  0.690758  0.907605 -1.420249
E -0.424708 -0.387945  1.753420  0.864991

In [16]:
df.drop('C',axis=0)  # This will drpo row C

          W         X         Y         Z
A -0.745157 -0.730127 -0.431263  1.928113
B  1.438835 -0.461587 -1.706683 -2.621806
D -1.219565  0.690758  0.907605 -1.420249
E -0.424708 -0.387945  1.753420  0.864991

In [17]:
df

          W         X         Y         Z
A -0.745157 -0.730127 -0.431263  1.928113
B  1.438835 -0.461587 -1.706683 -2.621806
C -0.190142  0.834918 -1.957688 -0.166679
D -1.219565  0.690758  0.907605 -1.420249
E -0.424708 -0.387945  1.753420  0.864991

# ***selecting rows***

In [18]:
df.loc['B']        # selection using label

W    1.438835
X   -0.461587
Y   -1.706683
Z   -2.621806
Name: B, dtype: float64

In [19]:
df.iloc[3]      # Selection using index

W   -1.219565
X    0.690758
Y    0.907605
Z   -1.420249
Name: D, dtype: float64

In [20]:
df

          W         X         Y         Z
A -0.745157 -0.730127 -0.431263  1.928113
B  1.438835 -0.461587 -1.706683 -2.621806
C -0.190142  0.834918 -1.957688 -0.166679
D -1.219565  0.690758  0.907605 -1.420249
E -0.424708 -0.387945  1.753420  0.864991

In [21]:
df.loc['A','X']   # selection using subset of rows and columns

-0.7301267812651919

In [22]:
df.loc[['C','D']]

          W         X         Y         Z
C -0.190142  0.834918 -1.957688 -0.166679
D -1.219565  0.690758  0.907605 -1.420249

In [23]:
df.loc[['C','D'], ['X','Y']]

          X         Y
C  0.834918 -1.957688
D  0.690758  0.907605

***Conditional Selection***

In [24]:
df

          W         X         Y         Z
A -0.745157 -0.730127 -0.431263  1.928113
B  1.438835 -0.461587 -1.706683 -2.621806
C -0.190142  0.834918 -1.957688 -0.166679
D -1.219565  0.690758  0.907605 -1.420249
E -0.424708 -0.387945  1.753420  0.864991

In [25]:
df>0

       W      X      Y      Z
A  False  False  False   True
B   True  False  False  False
C  False   True  False  False
D  False   True   True  False
E  False  False   True   True

In [26]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN  1.928113
B  1.438835       NaN       NaN       NaN
C       NaN  0.834918       NaN       NaN
D       NaN  0.690758  0.907605       NaN
E       NaN       NaN  1.753420  0.864991

In [27]:
df[df['X']>0]

          W         X         Y         Z
C -0.190142  0.834918 -1.957688 -0.166679
D -1.219565  0.690758  0.907605 -1.420249

In [28]:
df[df['X']>0]['Z']

C   -0.166679
D   -1.420249
Name: Z, dtype: float64

In [29]:
df[df['X']>0][['Z','Y']]

          Z         Y
C -0.166679 -1.957688
D -1.420249  0.907605

In [30]:
df[(df['X']>0) & (df['W']<0)]

          W         X         Y         Z
C -0.190142  0.834918 -1.957688 -0.166679
D -1.219565  0.690758  0.907605 -1.420249

In [31]:
df[(df['X']>0) | (df['Y']<0)]

          W         X         Y         Z
A -0.745157 -0.730127 -0.431263  1.928113
B  1.438835 -0.461587 -1.706683 -2.621806
C -0.190142  0.834918 -1.957688 -0.166679
D -1.219565  0.690758  0.907605 -1.420249

# More Index Details

In [32]:
df

          W         X         Y         Z
A -0.745157 -0.730127 -0.431263  1.928113
B  1.438835 -0.461587 -1.706683 -2.621806
C -0.190142  0.834918 -1.957688 -0.166679
D -1.219565  0.690758  0.907605 -1.420249
E -0.424708 -0.387945  1.753420  0.864991

In [33]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.745157 -0.730127 -0.431263  1.928113
1     B  1.438835 -0.461587 -1.706683 -2.621806
2     C -0.190142  0.834918 -1.957688 -0.166679
3     D -1.219565  0.690758  0.907605 -1.420249
4     E -0.424708 -0.387945  1.753420  0.864991

In [34]:
new = 'TX CO NY WI TN'.split()

In [35]:
df['States']=new

In [36]:
df

          W         X         Y         Z States
A -0.745157 -0.730127 -0.431263  1.928113     TX
B  1.438835 -0.461587 -1.706683 -2.621806     CO
C -0.190142  0.834918 -1.957688 -0.166679     NY
D -1.219565  0.690758  0.907605 -1.420249     WI
E -0.424708 -0.387945  1.753420  0.864991     TN

In [37]:
df.set_index('States')

               W         X         Y         Z
States
TX     -0.745157 -0.730127 -0.431263  1.928113
CO      1.438835 -0.461587 -1.706683 -2.621806
NY     -0.190142  0.834918 -1.957688 -0.166679
WI     -1.219565  0.690758  0.907605 -1.420249
TN     -0.424708 -0.387945  1.753420  0.864991

In [38]:
df

          W         X         Y         Z States
A -0.745157 -0.730127 -0.431263  1.928113     TX
B  1.438835 -0.461587 -1.706683 -2.621806     CO
C -0.190142  0.834918 -1.957688 -0.166679     NY
D -1.219565  0.690758  0.907605 -1.420249     WI
E -0.424708 -0.387945  1.753420  0.864991     TN

In [39]:
df.set_index('States', inplace =True)

In [40]:
df

               W         X         Y         Z
States
TX     -0.745157 -0.730127 -0.431263  1.928113
CO      1.438835 -0.461587 -1.706683 -2.621806
NY     -0.190142  0.834918 -1.957688 -0.166679
WI     -1.219565  0.690758  0.907605 -1.420249
TN     -0.424708 -0.387945  1.753420  0.864991

# Multi Index & Hierarchy

In [41]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [42]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [43]:
df =pd.DataFrame(np.random.rand(6,2), index= hier_index, columns = ['A','B'])

In [44]:
df

             A         B
G1 1  0.350728  0.384067
   2  0.765984  0.578683
   3  0.589162  0.816313
G2 1  0.074068  0.952048
   2  0.417662  0.128867
   3  0.360410  0.069186

In [45]:
df.loc['G1']

          A         B
1  0.350728  0.384067
2  0.765984  0.578683
3  0.589162  0.816313

In [46]:
df.loc['G1'].loc[1]

A    0.350728
B    0.384067
Name: 1, dtype: float64

In [47]:
df.loc['G1'].iloc[1]    # can use loc or iloc as done

A    0.765984
B    0.578683
Name: 2, dtype: float64

In [48]:
df.index.names

FrozenList([None, None])

In [49]:
df.index.names = ['Group', 'Num']

In [50]:
df

                  A         B
Group Num
G1    1    0.350728  0.384067
      2    0.765984  0.578683
      3    0.589162  0.816313
G2    1    0.074068  0.952048
      2    0.417662  0.128867
      3    0.360410  0.069186

In [51]:
df.xs('G1')

            A         B
Num
1    0.350728  0.384067
2    0.765984  0.578683
3    0.589162  0.816313

In [52]:
df.xs(['G1',1])

A    0.350728
B    0.384067
Name: (G1, 1), dtype: float64

In [53]:
df.xs(1,level='Num')

              A         B
Group
G1     0.350728  0.384067
G2     0.074068  0.952048

# Thank you!